{"pages":[],"posts":[{"title":"人生到处知何似","text":"人的一生究竟是要怎样度过呢？ 人的一生究竟是要怎样度过呢？毫无疑问，一个人的生命应当这样度过：当他回首往事的时候，也不因虚度年华而悔恨，也不因碌碌无为而羞愧。我希望给自己订一个计划，来为自己的未来指引方向。这个计划不要太高，不然自己会畏惧而无法达到。也希望这个计划不要太过于平庸，那样我会感到碌碌无为而无所得。这个计划至少在我本人看来是伟大的，即便在走过了漫长的生活道路，饱尝了辛酸后，我也会对自己所做的一切而感到骄傲。我又该抱着怎么样的心态来看待自己的计划，实现自己的计划呢？我引用苏轼的诗来明志。 人生到处知何似，应似飞鸿踏雪泥。 泥上偶然留指爪，鸿飞那复计东西。 老僧已死成新塔，坏壁无由见旧题。 往日崎岖还记否，路长人困蹇驴嘶。 我从未想过要做一个宏伟的计划，只希望能够尽自己微薄之力，让生活变得好一些。那么我现在的计划应该是什么呢？ 数学 数学分析 再读数学分析，练习连续性、级数、积分等知识。 高等代数 再读高等代数，练习对角矩阵，逆矩阵等证明题。 数值分析 再读数值分析，深刻理解插值法、函数逼近、方程组解法、最小二乘法、矩阵特征值、蒙卡模拟等基础方法。 常微分方程 复习简单内容：求解方法、解的性质、在人口学、金融学应用。 复分析 复习洛朗展开等与数学分析相关内容。 实分析 自学实分析二 伽罗瓦群 几何应用 求根应用 拓扑学 统计 概率统计 通读许钟好与茆诗松概率统计，完成所有习题。 贝叶斯统计 了解贝叶斯统计 回归分析 了解回归分析 随机过程 了解随机过程 信息 数据挖掘 提高数据降噪清洗、模型算法的实操能力，参加kaggle比赛。 python 练习使用python调包做机器学习和自然语言处理，多联系oj习题 java 尝试用java与人合作写出小企业应用 经济 微观经济学 曼昆经济学，达到可以清楚讲述能力 宏观经济学 曼昆经济学，达到可以清楚讲述能力 计量经济学 时间序列分析 英文 toefl 100以上 其它 锻炼好身体 教师资格证 机动车驾照 找一份实习我对未来的要求又是怎样的呢？首先作为传统的中国人，我最想要的还是稳定的生活。出身贫寒的人当然想先有一个不错的收入，这个收入应该是可以充分满足到生活所需；其次就是能够伉俪情深；还希望能够有所居与用；最后，我认为人一定要有自己的爱好与情趣，不然生活会变得很无聊。我要怎样才能实现这样的目标呢？当然必须要找到一份不错的工作，目前在我面前有三个选择，","link":"/2018/11/16/first/"},{"title":"实分析","text":"参考书籍：《数学分析》 第四版 华东师大《实分析》第三版 陶哲轩 实数集与函数：实数这里我用的课本是陶哲轩的实分析，对于实数讲的比较严谨清晰。证明实数的过程如下：$\\color{teal}{自然数{\\Bbb {N}}\\implies整数{\\Bbb {Z}}\\implies有理数{\\Bbb {Q}}\\implies实数{\\Bbb {R}}\\implies复数{\\Bbb {Q}}}$ 自然数Peano公理我们要定义实数，就要先定义什么是自然数。因此，我们陈述以下公理：1. $0$是一个自然数。2. 若 $n$ 是自然数，则 $n++$ 也是自然数.。 （这里的n++意思是n往后一位的数字）3. $0$不是任何自然数的后继。公理三出现的原因是：例如在计算机中，因为储存单元有限，一旦数字大过某一值后，再$++$就会变为$0$. Eg:如果只能记忆三个数字,则在{$0,1,2,3$} 中，在 $3++$ 后，会变成$0$。**4.不同自然数必有不容后继者；即：若$n,m$是自然数且$n\\neq m$,则$n++ \\neq m++$。","link":"/2019/11/15/real_analysis/"},{"title":"微分方程","text":"参考书籍：《常微分方程教程》 第二版 丁同仁Myint-U, T., Partial Differential Equations for Scientists and Engineers, 3rd. ed., 1988 微分方程作用： 1.常微分方程可以预测未来 1.1 推演出天体运动轨道，发现新天体 1.2 预测人口、传染病发展趋势 2.控制理论 2.1 通过微分方程实现信号控制 2.2 计算温度分布，优化空间配置 微分方程及解的定义微分方程定义：包含未知函数的导数的方程常微分方程定义：联系自变量 $x$、$y=y(x)$、和函数 $y^{(n)}=y^{(n)}(x)$ 在内的方程。$$Eg:F(x,y,y^{‘},…,y^{(n)})=0$$阶的定义：导数实际出现最高阶数 $n$ 叫方程的阶线性： $y,y,y^{‘},…,y^{(n)}$ 的组合是一次的，即不能相互之间出现乘法。偏微分方程：未知函数是多元函数。$$Eg:x\\frac{\\partial f}{\\partial x}+y\\frac{\\partial f}{\\partial y}+z\\frac{\\partial f}{\\partial z}=0$$解的定义：函数在区间上连续，且有直到 $n$ 阶的导数。如果将函数$y=f(x)$及其各阶导数带入ode，得到$F(x,y,y^{‘},…,y^{(n)})=0$,$\\forall x\\in J$都成立，则称 $y=f(x)$ 为ode的一个解。通解 初等积分法恰当方程变量分析的方程一阶线性方程初等变换法齐次方程伯努利方程里卡蒂方程积分因子法存在和惟一定定理皮卡存在唯一性定理皮亚诺存在定理解的延伸奇解一阶隐式微分方程微分法参数法奇解包络高阶微分方程","link":"/2019/11/11/ode/"}],"tags":[],"categories":[{"name":"其它","slug":"其它","link":"/categories/%E5%85%B6%E5%AE%83/"},{"name":"数学","slug":"数学","link":"/categories/%E6%95%B0%E5%AD%A6/"}]}